tg2admin/app/controllers/users_controller.rb

INSERT INTO "users" ("gid", "username", "firstname", "lastname", "password", "pwexpires", "pwhint", "notes", "city", "state", "postalcode", "country", "email", "gender", "address1", "address2", "phone1", "phone2", "bday", "lastlogin", "enabled", "mailbox", "logintotal", "timebank", "loginfailed", "mailquota", "totalposts", "totaluploads", "totaldownloads", "created_at", "updated_at") VALUES(NULL, '', '', '', '', NULL, '', '', '', '', '', '', '', '', '', '', '', '', NULL, NULL, 'f', 'f', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2009-11-29 19:27:19.973000', '2009-11-29 19:27:19.973000')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 3)
UPDATE "users" SET "firstname" = 'Chris', "lastname" = 'Tusa', "pwexpires" = NULL, "updated_at" = '2009-11-29 21:34:58.159000' WHERE "id" = 3
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])